conduit-api/app/controllers/application_controller.rb

  def decode_user_from_token
    token = extract_token_from_header
    raise ExceptionHandler::MissingToken if token.nil?

    decoded_token = JwtService.decode(token)
    User.find(decoded_token[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1