conduit-api/app/controllers/api/v1/users_controller.rb

      def login
        parsed_email = login_params[:email].downcase

        user = User.find_by!(email: parsed_email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'auth_1775357913582yz55@test.com' LIMIT 1

      def create
        user = User.new(registration_params)

        if user.save
---
INSERT INTO "users" ("bio", "created_at", "email", "image", "password_digest", "updated_at", "username") VALUES ('', '2026-04-05 03:04:54.346798', 'auth_1775357913582yz55@test.com', '', '$2a$12$mTZ6iUKatWbq/FtlW4Mc0ekfKGCWrifN6Yxn/HzXur52fYdEd1z8u', '2026-04-05 03:04:54.346798', 'auth_1775357913582yz55') RETURNING "id"

      def update

        if current_user.update(update_params)
---
UPDATE "users" SET "image" = 'https://example.com/temp.jpg', "updated_at" = '2026-04-05 03:44:19.568973' WHERE "users"."id" = 4